src/InformationRegisters/АктуализацияСтруктурыПС/АктуализацияСтруктурыПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуализацияСтруктурыПС</name>
  <resources>
    <name>Отложен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/АктуализацияСтруктурыПС/ManagerModule.bsl
///////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ДобвавитьЗапись(ПредметСнабжения) Экспорт 
	Запись 					= РегистрыСведений.АктуализацияСтруктурыПС.СоздатьМенеджерЗаписи();
	Запись.ПредметСнабжения = ПредметСнабжения;
	Запись.Дата 			= ТекущаяДата();
	Запись.Записать();
КонецПроцедуры // ДобвавитьЗапись
